faloj/zephyr/drivers/usb/uhc/uhc_dwc_stm32.c
/*
 * Copyright (c) 2023 Intel Corporation
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * @file  uhc_stm32_hs.c
 * @brief Synopsis DWC 2.0 USB host controller (UHC) driver
 *
 * OTG controller driver is enabled to work only in host mode with support for control and bulk
 * endpoints. Driver is enabled to work in buffered internal DMA mode.
 */

#include <stm32_ll_pwr.h>
#include <zephyr/cache.h>
#include <zephyr/kernel.h>
#include "uhc_common.h"
#include <string.h>
#include <zephyr/init.h>
#include <zephyr/usb/usbh.h>
#include <zephyr/drivers/usb/uhc.h>
#include <zephyr/logging/log.h>
#include <zephyr/drivers/reset.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/gpio.h>

LOG_MODULE_REGISTER(uhc_stm32, CONFIG_UHC_DRIVER_LOG_LEVEL);
#define DT_DRV_COMPAT st_stm32_otghs

#define DT_CLOCKS_PROP_MAX_LEN (2)

static K_KERNEL_STACK_DEFINE(drv_stack, CONFIG_DWC_THREAD_STACK_SIZE);
static struct k_thread drv_stack_data;

USBH_CONTROLLER_DEFINE(stm32_otg_ctx, DEVICE_DT_GET(DT_DRV_INST(0)));

/* DWC Register Offsets */
/* OTG control and status register offset */
#define DWC_GOTGCTL_OFFSET   (0x0u)
/* OTG interrupt register offset */
#define DWC_GOTGINT_OFFSET   (0x4u)
/* AHB configuration register offset */
#define DWC_GAHBCFG_OFFSET   (0x8u)
/* USB configuration register offset */
#define DWC_GUSBCFG_OFFSET   (0xCu)
/* Reset register offset */
#define DWC_GRSTCTL_OFFSET   (0x10u)
/* Interrupt register offset */
#define DWC_GINTSTS_OFFSET   (0x14u)
/* Interrupt mask register offset */
#define DWC_GINTMSK_OFFSET   (0x18u)
/* Receive FIFO size register offset */
#define DWC_GRXFSIZ_OFFSET   (0x24u)
/* Non-periodic transmit FIFO size register offset */
#define DWC_GNPTXFSIZ_OFFSET (0x28u)
/* Non-periodic transmit FIFO/Queue status register offset */
#define DWC_GNPTXSTS_OFFSET  (0x2Cu)
/* Host periodic transmit FIFO size register offset */
#define DWC_HPTXFSIZ_OFFSET  (0x100u)
/* Host configuration register offset */
#define DWC_HCFG_OFFSET	     (0x400u)
/* Host frame interval register offset */
#define DWC_HFIR_OFFSET	     (0x404u)
/* Host frame number/frame time remaining register offset */
#define DWC_HFNUM_OFFSET     (0x408u)
/* Host all channels interrupt register offset */
#define DWC_HAINT_OFFSET     (0x414u)
/* Host all channels interrupt mask register offset */
#define DWC_HAINTMSK_OFFSET  (0x418u)
/* Host port control and status register offset */
#define DWC_HPRT_OFFSET	     (0x440u)
/* Host channel 0 characteristics register offset */
#define DWC_HCCHAR0_OFFSET   (0x500u)
/* Host channel 0 interrupt register offset */
#define DWC_HCINT0_OFFSET    (0x508u)
/* Host channel 0 interrupt mask register offset */
#define DWC_HCINTMSK0_OFFSET (0x50Cu)
/* Host channel 0 transfer size register offset */
#define DWC_HCTSIZ0_OFFSET   (0x510u)
/* Host channel 0 DMA address register offset */
#define DWC_HCDMA0_OFFSET    (0x514u)
/* Power and clock gating control register offset */
#define DWC_PCGCCTL_OFFSET   (0xE00u)

/* DWC Register Masks and Bit Definitions */
/* global interrupt mask */
#define DWC_GAHBCFG_GINTMSK		  (0u)
/* full speed serial transceiver select for USB OTG HS */
#define DWC_GUSBCFG_PHYSEL		  (6u)
/* TermSel DLine pulsing selection for USB OTG HS */
#define DWC_GUSBCFG_TSDPS		  (22u)
/* ULPI External VBUS Drive for USB OTG HS */
#define DWC_GUSBCFG_ULPIEVBUSD		  (20u)
/* ULPI external VBUS indicator for USB OTG HS */
#define DWC_GUSBCFG_ULPIEVBUSI		  (21u)
/* core soft reset */
#define DWC_GRSTCTL_CSRST		  (0u)
/* AHB master IDLE */
#define DWC_GRSTCTL_AHBIDL		  (31u)
/* DMA enabled for USB OTG HS */
#define DWC_GAHBCFG_DMAEN		  (5u)
/* bus transactions target  4x 32-bit accesses */
#define DWC_GAHBCFG_HBSTLEN_INCR4	  (GENMASK(2, 1))
/* force host mode */
#define DWC_GUSBCFG_FHMOD		  (29u)
/* force device mode */
#define DWC_GUSBCFG_FDMOD		  (30u)
/* FS and LS PHY clock select */
#define DWC_HCFG_FSLSPclkSel		  (0u)
/* FS and LS-only support */
#define DWC_HCFG_FSLS_SUPPORT		  (2u)
/* tx FIFO flush */
#define DWC_GRSTCTL_TXFFLSH		  (5u)
/* tx FIFO number bit 0 */
#define DWC_GRSTCTL_TxF_NUM_BIT_0	  (6u)
/* flush all the transmit FIFOs in host mode */
#define DWC_GRSTCTL_FLUSH_ALL_TXFIFO	  (0x10u)
/* rx FIFO flush */
#define DWC_GRSTCTL_RXFFLSH		  (4u)
/* port power */
#define DWC_HPRT_PORT_PWR		  (12u)
/* current mode */
#define DWC_GINTSTS_CURR_MOD		  (1u)
/* resume/remote wakeup detected interrupt mask */
#define DWC_GINTx_WKUPINT		  (31u)
/* host port interrupt */
#define DWC_GINTx_HPRTINT		  (24u)
/* receive FIFO non-empty interrupt mask */
#define DWC_GINTx_RXFLVL		  (4u)
/* start of frame interrupt */
#define DWC_GINTx_SOF			  (3u)
/* disconnect detected interrupt */
#define DWC_GINTx_DISCINT		  (29u)
/* host Channel interrupt */
#define DWC_GINTx_HCINT			  (25u)
/* periodic TX FIFO empty */
#define DWC_GINTx_PTXFE			  (26u)
/* nonperiodic TX FIFO empty */
#define DWC_GINTx_NPTXFE		  (5u)
/* mode mismatch */
#define DWC_GINTx_MMIS			  (1u)
/* incomplete periodic transfer mask */
#define DWC_GINTx_INCOMPLP		  (21u)
/* port connect status */
#define DWC_HPRT_PORT_CONN_STS		  (0u)
/* port connect detected */
#define DWC_HPRT_PORT_CONN_DET		  (1u)
/* port enable */
#define DWC_HPRT_PORT_EN		  (2u)
/* port enable/disable change */
#define DWC_HPRT_PORT_ENCHNG		  (3u)
/* port reset */
#define DWC_HPRT_PORT_RST		  (8u)
/* port speed bit 0 */
#define DWC_HPRT_PORT_SPEED_BIT_0	  (17u)
/* port speed mask */
#define DWC_HPRT_PORT_SPD_MSK		  (GENMASK(18, 17))
/* port Speed bits */
#define DWC_HPRT_PORT_SPD_FS		  (0x00020000u)
/* Port overcurrent change */
#define DWC_HPRT_PORT_OCCHNG		  (5u)
/* channel number mask */
#define DWC_GRXSTSP_CHNUM_Msk		  (GENMASK(3, 0))
/* byte count mask */
#define DWC_GRXSTSP_BCNT_Msk		  (GENMASK(14, 4))
/* packet status mask */
#define DWC_GRXSTSP_PKTSTS_Msk		  (GENMASK(20, 17))
/* non periodic tx request queue space available mask */
#define DWC_GNPTXSTS_NPTxQSpcAvail_MASK	  (GENMASK(23, 16))
/* transfer complete interrupt */
#define DWC_HCINTx_XFRC			  (0u)
/* channel halted interrupt */
#define DWC_HCINTx_CHH			  (1u)
/* AHB err for USB OTG HS */
#define DWC_HCINTx_AHBERR		  (2u)
/* stall response received interrupt */
#define DWC_HCINTx_STALL		  (3u)
/* nak response received interrupt */
#define DWC_HCINTx_NAK			  (4u)
/* ack response received/transmitted interrupt */
#define DWC_HCINTx_ACK			  (5u)
/* not yet ready response received intr for USB OTG HS */
#define DWC_HCINTx_NYET			  (6u)
/* transaction error interrupt */
#define DWC_HCINTx_TXERR		  (7u)
/* babble error interrupt */
#define DWC_HCINTx_BBERR		  (8u)
/* frame overrun interrupt */
#define DWC_HCINTx_FRMOR		  (9u)
/* data toggle error interrupt */
#define DWC_HCINTx_DTERR		  (10u)
/* transfer complete interrupt */
#define DWC_HCINTMSKx_XFRC		  (0u)
/* channel halted interrupt */
#define DWC_HCINTMSKx_CHH		  (1u)
/* AHB err for USB OTG HS */
#define DWC_HCINTMSKx_AHBERR		  (2u)
/* stall response received interrupt */
#define DWC_HCINTMSKx_STALL		  (3u)
/* nak response received interrupt */
#define DWC_HCINTMSKx_NAK		  (4u)
/* ack response received/transmitted interrupt */
#define DWC_HCINTMSKx_ACK		  (5u)
/* not yet ready response received intr for USB OTG HS */
#define DWC_HCINTMSKx_NYET		  (6u)
/* transaction error interrupt */
#define DWC_HCINTMSKx_TXERR		  (7u)
/* babble error interrupt */
#define DWC_HCINTMSKx_BBERR		  (8u)
/* frame overrun interrupt */
#define DWC_HCINTMSKx_FRMOR		  (9u)
/* data toggle error interrupt */
#define DWC_HCINTMSKx_DTERR		  (10u)
/* max packet size mask */
#define DWC_HCCHARx_MPSIZ_Msk		  (GENMASK(10, 0))
/* endpoint direction */
#define DWC_HCCHARx_EPDIR		  (15u)
/* low speed device */
#define DWC_HCCHARx_LSDEV		  (17u)
/* endpoint number bit 0 */
#define DWC_HCCHARx_EP_NUM_BIT_0	  (11u)
/* endpoint type bit 0 */
#define DWC_HCCHARx_EP_TYPE_BIT_0	  (18u)
/* device address bit 0 */
#define DWC_HCCHARx_DEV_ADDR_BIT_0	  (22u)
/* odd frame bit 0 */
#define DWC_HCCHARx_ODD_FRM_BIT_0	  (29u)
/* device address mask */
#define DWC_HCCHARx_DEVADRR_Msk		  (GENMASK(28, 22))
/* endpoint number mask */
#define DWC_HCCHARx_EPNUM_Msk		  (GENMASK(14, 11))
/* endpoint type mask */
#define DWC_HCCHARx_EPTYP_Msk		  (GENMASK(19, 18))
/* packet count bit 0 */
#define DWC_HCTSIZx_PKT_CNT_BIT_0	  (19u)
/* PID bit 0 */
#define DWC_HCTSIZx_PID_BIT_0		  (29u)
/* transfer size mask */
#define DWC_HCTSIZx_XFRSIZ_MSK		  (GENMASK(18, 0))
/* packet count mask */
#define DWC_HCTSIZx_PKTCNT_MSK		  (GENMASK(28, 19))
/* data PID mask */
#define DWC_HCTSIZx_DPID_MSK		  (GENMASK(30, 29))
/* odd frame */
#define DWC_HCCHARx_ODDFRM		  (29u)
/* channel disable */
#define DWC_HCCHARx_CHDIS		  (30u)
/* channel enable */
#define DWC_HCCHARx_CHENA		  (31u)
/* do ping */
#define DWC_HCTSIZx_DOPING		  (31u)
/* packet status IN */
#define DWC_GRXSTS_PKTSTS_IN		  (2u)
/* transfer complete */
#define DWC_GRXSTS_PKTSTS_IN_XFER_COMP	  (3u)
/* data toggle error */
#define DWC_GRXSTS_PKTSTS_DATA_TOGGLE_ERR (5u)
/* channel halted */
#define DWC_GRXSTS_PKTSTS_CH_HALTED	  (7u)
/* no of stages in a control transfer */
#define DWC_CTRL_STAGES_NUM		  (3u)
/* maximum number of channels */
#define DWC_MAX_NBR_CH			  (16u)
/* frame interval */
#define DWC_HFIR_FRAME_INTERVAL		  (48000u)
/* frame interval value for full speed */
#define DWC_HFIR_FRAME_INTERVAL_FS	  (60000u)
/* default max packet size */
#define DWC_DEFAULT_MPS			  (0x40u)
/* default address */
#define DWC_DEFAULT_ADDRESS		  (0u)
/* out control pipe number */
#define DWC_DEFAULT_CTRL_PIPE_OUT	  (0u)
/* in control pipe number */
#define DWC_DEFAULT_CTRL_PIPE_IN	  (1u)
/* in bulk pipe number */
#define DWC_DEFAULT_BULK_PIPE_IN	  (2u)
/* out bulk pipe number */
#define DWC_DEFAULT_BULK_PIPE_OUT	  (3u)
/* control endpoint number */
#define DWC_EP_TYPE_CTRL		  (0u)
/* isochronous endpoint number */
#define DWC_EP_TYPE_ISOC		  (1u)
/* bulk endpoint number */
#define DWC_EP_TYPE_BULK		  (2u)
/* interrupt endpoint number */
#define DWC_EP_TYPE_INTR		  (3u)
/* endpoint type mask */
#define DWC_EP_TYPE_MSK			  (3u)
/* high speed device */
#define DWC_DEVICE_SPEED_HIGH		  (0u)
/* full speed device */
#define DWC_DEVICE_SPEED_FULL		  (1u)
/* low speed device */
#define DWC_DEVICE_SPEED_LOW		  (2u)
/* setup PID value */
#define DWC_PID_SETUP			  (0u)
/* data PID value */
#define DWC_PID_DATA			  (1u)
/* setup packet size */
#define DWC_SETUP_PKT_SIZE		  (8u)
/* data 0 PID value */
#define DWC_HC_PID_DATA0		  (0u)
/* data 1 PID value */
#define DWC_HC_PID_DATA2		  (1u)
/* data 2 PID value */
#define DWC_HC_PID_DATA1		  (2u)
/* host channel setup PID value */
#define DWC_HC_PID_SETUP		  (3u)
/* maximum reset retry value */
#define DWC_MAX_RESET_TRIES		  (3u)
/* maximum packet count */
#define DWC_MAX_HC_PKT_CNT		  (256u)
/* timeout value in microseconds used during reset and flush operations */
#define DWC_TIMEOUT_VAL		          (10000u)
/* halt channel timeout value in microseconds */
#define DWC_HALT_CH_TIMEOUT_VAL		  (1u)
/* host timeout value in microseconds */
#define DWC_HOST_TIMEOUT_VAL		  (500000u)
/* port reset timeout value in milliseconds */
#define DWC_PORT_RESET_TIMEOUT_VAL        (100u)
/* NAK timeout value */
#define DWC_NAK_TIMEOUT_VAL		  (70000U)
/* clear all interrupts */
#define DWC_CLR_ALL_INTERRUPTS		  (0xFFFFFFFFU)
/* host mode */
#define DWC_HOST_MODE			  (1u)
/* RxFIFO Depth */
#define DWC_RxFDep			  (0x200U)
/* Non-periodic TxFIFO Depth */
#define DWC_NPTxFDep			  (0x100U)
/* Non-periodic TxFIFO Depth Bit 0 position */
#define DWC_NPTxFDep_Bit0_pos             (16u)
/* Non-periodic Transmit RAM Start Address */
#define DWC_NPTxStAddr			  (0x200U)
/* Host Periodic TxFIFO Depth */
#define DWC_HPTxFDep			  (0x100U)
/* Host Periodic TxFIFO Depth Bit 0 position */
#define DWC_HPTxFDep_Bit0_pos             (16u)
/* Host Periodic TxFIFO Start Address */
#define DWC_HPTxStAddr			  (0x300U)

