faloj/zephyr/drivers/usb/uhc/uhc_dwc_stm32.c
/* additional helper macros */
/* Total size of a channel register set */
#define DWC_CHx_REGS_SIZ			  (0x20u)
/* Register offset of a channel X register */
#define DWC_CHx_REG_OFFSET(reg_addr, i)		  (reg_addr + (i * DWC_CHx_REGS_SIZ))
/* Check interrupt source of a register */
#define DWC_INTERRUPT_CHECK_SOURCE(reg, bit_mask) ((reg & bit_mask) == bit_mask)
/* Check interrupt source of global interrupt register */
#define DWC_GLOBAL_INTERRUPT_CHECK_SOURCE(gintsts_val, gintmsk_val, bit_mask)                     \
	(((gintsts_val & gintmsk_val) & bit_mask) == bit_mask)

/* host channel states */
enum hc_state {
	DWC_HC_IDLE = 0,
	DWC_HC_XFRC,
	DCW_HC_HALTED,
	DCW_HC_NAK,
	DCW_HC_NYET,
	DCW_HC_STALL,
	DCW_HC_XACTERR,
	DCW_HC_BBLERR,
	DCW_HC_DATATGLERR
};

/* URB states */
enum urb_state {
	DCW_URB_IDLE = 0U,
	DCW_URB_DONE,
	DCW_URB_NOTREADY,
	DCW_URB_NYET,
	DCW_URB_ERROR,
	DCW_URB_STALL
};

/* host channel management */
struct host_ch_mng {
	/* transfer buffer of transfer */
	volatile uint8_t *xfer_buff;
	/* total transfer size */
	volatile uint32_t xfer_sz;
	/* transfer length */
	volatile uint32_t xfer_len;
	/* error count of transfer */
	volatile uint32_t err_cnt;
	/* state of the host channel during transfer */
	volatile enum hc_state state;
	/* URB state of transfer */
	volatile enum urb_state urb_state;
	/* max packet size of the transfer */
	volatile uint16_t max_packet;
	/* device address */
	volatile uint8_t dev_addr;
	/* channel number of the transfer */
	volatile uint8_t ch_num;
	/* endpoint number */
	volatile uint8_t ep_num;
	/* direction of transfer */
	volatile bool ep_is_in;
	/* speed of the device */
	volatile uint8_t speed;
	/* endpoint type */
	volatile uint8_t ep_type;
	/* data PID value of transfer */
	volatile uint8_t data_pid;
	/* toggle in value for the transfer */
	volatile uint8_t toggle_in;
	/* toggle out value for the transfer */
	volatile uint8_t toggle_out;
};

/* pipe management */
struct pipe_mng {
	/* new device address */
	volatile uint8_t addr;
	/* request type  */
	volatile uint8_t request;
	/* descriptor type of the request */
	volatile uint8_t desc_type;
	/* has default device data changed */
	volatile bool data_change;
};

/* device private data */
struct dev_priv_data {
	/* pointer to controller device instance */
	const struct device *dev;
	/* controller base address */
	volatile mem_addr_t base_addr;
	struct k_fifo fifo;
	/* pointer to last UHC transfer */
	struct uhc_transfer *last_xfer;
	/* semaphore to signal transfers scheduling between driver and core layers */
	struct k_sem xfr_sem;
	/* semaphore to signal transfer events within driver layer */
	struct k_sem xfr_event_sem;
	/* host channel management */
	struct host_ch_mng hch[DWC_MAX_NBR_CH];
	/* pipe management information */
	struct pipe_mng pipe_info;
	/* current state of the URB transfer */
	volatile enum urb_state curr_state;
	/* transfer schedule status */
	volatile bool schedule;
	/* device connection status */
	volatile bool device_connected;
	/* port enable status */
	volatile bool port_enabled;
	/* descriptor type of the request */
	uint8_t desc_type;
	/* request type */
	uint8_t bRequest;
	/* is it control transfer */
	bool is_ctrl_xfer;
};

/* device configuration structure */
struct uhc_cfg {
	DEVICE_MMIO_ROM;
	/* Reset controller device configurations */
	struct reset_dt_spec reset_spec;
	struct pinctrl_dev_config *pcfg;
	struct gpio_dt_spec vbus_enable_gpio;
	struct stm32_pclken clocks[DT_CLOCKS_PROP_MAX_LEN];
};

/* get speed of device attached */
static uint32_t uhc_stm32_get_speed(mem_addr_t base_addr)
{
	uint32_t reg_val = 0;

	reg_val = sys_read32(base_addr + DWC_HPRT_OFFSET);
	return ((reg_val & DWC_HPRT_PORT_SPD_MSK) >> DWC_HPRT_PORT_SPEED_BIT_0);
}

/* halt channel */
static int uhc_stm32_hch_halt(struct dev_priv_data *priv, uint32_t ch_num)
{
	mem_addr_t base_addr = priv->base_addr;
	mem_addr_t ch_addr = DWC_CHx_REG_OFFSET(DWC_HCCHAR0_OFFSET, ch_num);
	uint32_t ep_type = (sys_read32(base_addr + ch_addr) & DWC_HCCHARx_EPTYP_Msk) >>
			   DWC_HCCHARx_EP_TYPE_BIT_0;
	uint32_t ch_enable =
		(sys_read32(base_addr + ch_addr) & BIT(DWC_HCCHARx_CHENA)) >> DWC_HCCHARx_CHENA;
	uint32_t reg_val = 0;

	if ((DWC_INTERRUPT_CHECK_SOURCE(sys_read32(base_addr + DWC_GAHBCFG_OFFSET),
					BIT(DWC_GAHBCFG_DMAEN))) &&
	    (ch_enable == 0U)) {
		return 0;
	}

	/* check for space in the request queue to issue the halt */
	if ((ep_type == DWC_EP_TYPE_CTRL) || (ep_type == DWC_EP_TYPE_BULK)) {
		reg_val = sys_read32(base_addr + ch_addr);
		reg_val |= BIT(DWC_HCCHARx_CHDIS);
		sys_write32(reg_val, base_addr + ch_addr);

		if ((sys_read32(base_addr + DWC_GAHBCFG_OFFSET) & BIT(DWC_GAHBCFG_DMAEN)) == 0U) {
			if ((sys_read32(base_addr + DWC_GNPTXSTS_OFFSET) &
			     DWC_GNPTXSTS_NPTxQSpcAvail_MASK) == 0U) {
				reg_val = sys_read32(base_addr + ch_addr);
				reg_val &= ~BIT(DWC_HCCHARx_CHENA);
				sys_write32(reg_val, base_addr + ch_addr);

				reg_val = sys_read32(base_addr + ch_addr);
				reg_val |= BIT(DWC_HCCHARx_CHENA);
				sys_write32(reg_val, base_addr + ch_addr);

				/* wait for halting channel */
				if (!WAIT_FOR(!DWC_INTERRUPT_CHECK_SOURCE(
					sys_read32(base_addr + ch_addr), BIT(DWC_HCCHARx_CHENA)),
					DWC_HALT_CH_TIMEOUT_VAL, k_busy_wait(1))) {
					LOG_ERR("halt timeout expired");
					return -ETIMEDOUT;
				}
			} else {
				reg_val = sys_read32(base_addr + ch_addr);
				reg_val |= BIT(DWC_HCCHARx_CHENA);
				sys_write32(reg_val, base_addr + ch_addr);
			}
		}
	} else {
		LOG_ERR("endpoint not supported");
		return -ENOTSUP;
	}

	return 0;
}

/* initialize host channel */
static int uhc_stm32_hc_init(mem_addr_t base_addr, uint8_t ch_num, uint8_t epnum, uint8_t dev_address,
		       uint8_t speed, uint8_t ep_type, uint16_t mps)
{
	int ret = 0;
	uint32_t ep_dir;
	uint32_t low_speed;
	uint32_t core_speed;
	uint32_t reg_val = 0;
	mem_addr_t ch_addr = 0;

	/* clear old interrupt conditions for this host channel */
	ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
	reg_val = DWC_CLR_ALL_INTERRUPTS;
	sys_write32(reg_val, base_addr + ch_addr);

