faloj/zephyr/drivers/usb/uhc/uhc_dwc_stm32.c
	/* enable channel interrupts required for this transfer */
	switch (ep_type) {
	case DWC_EP_TYPE_CTRL:
	case DWC_EP_TYPE_BULK:
		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINTMSK0_OFFSET, ch_num);
		sys_write32(reg_val, base_addr + ch_addr);

		if (USB_EP_DIR_IS_IN(epnum)) {
			reg_val |= BIT(DWC_HCINTMSKx_BBERR);
			sys_write32(reg_val, base_addr + ch_addr);
		}
		break;

	case DWC_EP_TYPE_INTR:
	case DWC_EP_TYPE_ISOC:
	default:
		ret = -ENOTSUP;
		LOG_ERR("endpoint not supported for initialization");
		return ret;
	}

	/* enable host channel Halt interrupt */
	ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINTMSK0_OFFSET, ch_num);
	reg_val = sys_read32(base_addr + ch_addr);
	reg_val |= BIT(DWC_HCINTMSKx_CHH);
	sys_write32(reg_val, base_addr + ch_addr);

	/* enable the top level host channel interrupt */
	reg_val = sys_read32(base_addr + DWC_HAINTMSK_OFFSET);
	reg_val |= 1UL << (ch_num & 0xFU);
	sys_write32(reg_val, base_addr + DWC_HAINTMSK_OFFSET);

	/* make sure host channel interrupts are enabled */
	reg_val = sys_read32(base_addr + DWC_GINTMSK_OFFSET);
	reg_val |= BIT(DWC_GINTx_HCINT);
	sys_write32(reg_val, base_addr + DWC_GINTMSK_OFFSET);

	/* program the HCCHAR register */
	if (USB_EP_DIR_IS_IN(epnum)) {
		ep_dir = BIT(DWC_HCCHARx_EPDIR);
	} else {
		ep_dir = 0U;
	}

	core_speed = uhc_stm32_get_speed(base_addr);

	/* check if LS device plugged to port */
	if ((speed == DWC_DEVICE_SPEED_LOW) && (core_speed != DWC_DEVICE_SPEED_LOW)) {
		low_speed = BIT(DWC_HCCHARx_LSDEV);
	} else {
		low_speed = 0U;
	}

	ch_addr = DWC_CHx_REG_OFFSET(DWC_HCCHAR0_OFFSET, ch_num);
	reg_val =
		(((uint32_t)dev_address << DWC_HCCHARx_DEV_ADDR_BIT_0) & DWC_HCCHARx_DEVADRR_Msk) |
		((((uint32_t)epnum & 0x7FU) << DWC_HCCHARx_EP_NUM_BIT_0) & DWC_HCCHARx_EPNUM_Msk) |
		(((uint32_t)ep_type << DWC_HCCHARx_EP_TYPE_BIT_0) & DWC_HCCHARx_EPTYP_Msk) |
		((uint32_t)mps & DWC_HCCHARx_MPSIZ_Msk) | ep_dir | low_speed;
	sys_write32(reg_val, base_addr + ch_addr);

	return ret;
}

/* open pipe for communication */
static int uhc_stm32_open_pipe(struct dev_priv_data *priv, uint8_t ch_num, uint8_t epnum,
			 uint8_t dev_address, uint8_t speed, uint8_t ep_type, uint16_t mps)
{
	int ret_val;

	priv->hch[ch_num].dev_addr = dev_address;
	priv->hch[ch_num].max_packet = mps;
	priv->hch[ch_num].ch_num = ch_num;
	priv->hch[ch_num].ep_type = ep_type;
	priv->hch[ch_num].ep_num = epnum & 0x7FU;

	if (USB_EP_DIR_IS_IN(epnum)) {
		priv->hch[ch_num].ep_is_in = true;
	} else {
		priv->hch[ch_num].ep_is_in = false;
	}

	priv->hch[ch_num].speed = speed;
	ret_val = uhc_stm32_hc_init(priv->base_addr, ch_num, epnum, dev_address, speed, ep_type, mps);

	return ret_val;
}

/* initiate USB transfer */
static int uhc_stm32_start_transfer(mem_addr_t base_addr, struct host_ch_mng *p_hch, uint8_t dma)
{
	uint32_t ch_num = (uint32_t)p_hch->ch_num;
	uint8_t is_oddframe;
	uint16_t num_packets;
	uint16_t max_hc_pkt_count = DWC_MAX_HC_PKT_CNT;
	uint32_t reg_val = 0;
	mem_addr_t ch_addr = 0;

	/* in DMA mode host Core automatically issues ping  in case of NYET/NAK */
	if ((dma == 1U) &&
	    ((p_hch->ep_type == DWC_EP_TYPE_CTRL) || (p_hch->ep_type == DWC_EP_TYPE_BULK))) {
		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINTMSK0_OFFSET, ch_num);
		reg_val = sys_read32(base_addr + ch_addr);
		reg_val &= ~(BIT(DWC_HCINTMSKx_NYET) | BIT(DWC_HCINTMSKx_ACK) |
			     BIT(DWC_HCINTMSKx_NAK));
		sys_write32(reg_val, base_addr + ch_addr);
	}

	/* compute the expected number of packets associated to the transfer */
	if (p_hch->xfer_len > 0U) {
		num_packets =
			(uint16_t)((p_hch->xfer_len + p_hch->max_packet - 1U) / p_hch->max_packet);
		if (num_packets > max_hc_pkt_count) {
			num_packets = max_hc_pkt_count;
			p_hch->xfer_sz = (uint32_t)num_packets * p_hch->max_packet;
		}
	} else {
		num_packets = 1U;
	}

	/*
	 * for IN channel HCTSIZ.xfer_sz is expected to be an integer multiple of
	 * max_packet size.
	 */
	if (p_hch->ep_is_in) {
		p_hch->xfer_sz = (uint32_t)num_packets * p_hch->max_packet;
		sys_cache_data_invd_range((void *)p_hch->xfer_buff, p_hch->xfer_len);
	} else {
		p_hch->xfer_sz = p_hch->xfer_len;
		sys_cache_data_flush_range((void *)p_hch->xfer_buff, p_hch->xfer_len);
	}

	/* initialize the HCTSIZn register */
	ch_addr = DWC_CHx_REG_OFFSET(DWC_HCTSIZ0_OFFSET, ch_num);
	reg_val = (p_hch->xfer_sz & DWC_HCTSIZx_XFRSIZ_MSK) |
		  (((uint32_t)num_packets << DWC_HCTSIZx_PKT_CNT_BIT_0) & DWC_HCTSIZx_PKTCNT_MSK) |
		  (((uint32_t)p_hch->data_pid << DWC_HCTSIZx_PID_BIT_0) & DWC_HCTSIZx_DPID_MSK);
	sys_write32(reg_val, base_addr + ch_addr);

	if (dma != 0U) {
		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCDMA0_OFFSET, ch_num);
		reg_val = POINTER_TO_UINT(p_hch->xfer_buff);
		sys_write32(reg_val, base_addr + ch_addr);
	}

	reg_val = sys_read32(base_addr + DWC_HFNUM_OFFSET);
	is_oddframe = ((reg_val & 0x01U) != 0U) ? 0U : 1U;
	ch_addr = DWC_CHx_REG_OFFSET(DWC_HCCHAR0_OFFSET, ch_num);
	reg_val = sys_read32(base_addr + ch_addr);
	reg_val &= ~BIT(DWC_HCCHARx_ODDFRM);
	reg_val |= (uint32_t)is_oddframe << DWC_HCCHARx_ODD_FRM_BIT_0;
	sys_write32(reg_val, base_addr + ch_addr);

	/* set host channel enable */
	ch_addr = DWC_CHx_REG_OFFSET(DWC_HCCHAR0_OFFSET, ch_num);
	reg_val = sys_read32(base_addr + ch_addr);
	reg_val &= ~BIT(DWC_HCCHARx_CHDIS);

	/* make sure to set the correct ep direction */
	if (p_hch->ep_is_in) {
		reg_val |= BIT(DWC_HCCHARx_EPDIR);
	} else {
		reg_val &= ~BIT(DWC_HCCHARx_EPDIR);
	}
	reg_val |= BIT(DWC_HCCHARx_CHENA);
	sys_write32(reg_val, base_addr + ch_addr);

	return 0;
}

/* submit a transfer request for USB transfer */
static int uhc_stm32_submit_transfer_req(struct dev_priv_data *priv, uint8_t ch_num, bool data_in,
				   uint8_t ep_type, uint8_t token, uint8_t *p_buf, uint16_t length)
{
	int ret = 0;

	priv->hch[ch_num].ep_is_in = data_in;
	priv->hch[ch_num].ep_type = ep_type;

	if (token == 0u) {
		priv->hch[ch_num].data_pid = DWC_HC_PID_SETUP;
	} else {
		priv->hch[ch_num].data_pid = DWC_HC_PID_DATA1;
	}

	/* manage data toggle */
	switch (ep_type) {
	case DWC_EP_TYPE_CTRL:
		if ((token == 1U) && (!data_in)) { /*send data */
			if (length == 0U) {
				/* for status out stage, length = 0 and status out PID = 1 */
				priv->hch[ch_num].toggle_out = 1U;
			}

			/* set the data toggle bit as per the flag */
			if (priv->hch[ch_num].toggle_out == 0U) {
				/* Put the PID 0 */
				priv->hch[ch_num].data_pid = DWC_HC_PID_DATA0;
			} else {
				/* Put the PID 1 */
				priv->hch[ch_num].data_pid = DWC_HC_PID_DATA1;
			}
		}
		break;

