faloj/zephyr/drivers/usb/uhc/uhc_dwc_stm32.c
	case DWC_EP_TYPE_BULK:
		if (!data_in) {
			/* set the Data Toggle bit as per the flag */
			if (priv->hch[ch_num].toggle_out == 0U) {
				/* set the PID 0 */
				priv->hch[ch_num].data_pid = DWC_HC_PID_DATA0;
			} else {
				/* set the PID 1 */
				priv->hch[ch_num].data_pid = DWC_HC_PID_DATA1;
			}
		} else {
			if (priv->hch[ch_num].toggle_in == 0U) {
				priv->hch[ch_num].data_pid = DWC_HC_PID_DATA0;
			} else {
				priv->hch[ch_num].data_pid = DWC_HC_PID_DATA1;
			}
		}

		break;
	case DWC_EP_TYPE_INTR:
	case DWC_EP_TYPE_ISOC:
	default:
		ret = -ENOTSUP;
		LOG_ERR("endpoint not supported to transfer data");
		return ret;
	}

	priv->hch[ch_num].xfer_buff = p_buf;
	priv->hch[ch_num].xfer_len = length;
	priv->hch[ch_num].urb_state = DCW_URB_IDLE;
	priv->hch[ch_num].ch_num = ch_num;
	priv->hch[ch_num].state = DWC_HC_IDLE;

	return uhc_stm32_start_transfer(priv->base_addr, &priv->hch[ch_num], 1);
}

/* send a setup packet */
static int uhc_stm32_ctrl_send_setup(struct dev_priv_data *priv, uint8_t *buf, uint8_t pipe_num)
{
	int ret_val = 0;

	ret_val = uhc_stm32_submit_transfer_req(priv, pipe_num, false, DWC_EP_TYPE_CTRL, DWC_PID_SETUP,
					  buf, DWC_SETUP_PKT_SIZE);
	return ret_val;
}

/* control transfer receive data*/
static int uhc_stm32_ctrl_receive_data(struct dev_priv_data *priv, uint8_t *buf, uint16_t length,
				 uint8_t pipe_num)
{
	return uhc_stm32_submit_transfer_req(priv, pipe_num, true, DWC_EP_TYPE_CTRL, DWC_PID_DATA, buf,
					  length);
}

/* control transfer send data */
static int uhc_stm32_ctrl_send_data(struct dev_priv_data *priv, uint8_t *buf, uint16_t length,
			      uint8_t pipe_num)
{
	return uhc_stm32_submit_transfer_req(priv, pipe_num, false, DWC_EP_TYPE_CTRL, DWC_PID_DATA,
					  buf, length);
}

/* bulk transfer receive data */
static int uhc_stm32_bulk_receive_data(struct dev_priv_data *priv, uint8_t *buf, uint16_t length,
				 uint8_t pipe_num)
{
	return uhc_stm32_submit_transfer_req(priv, pipe_num, true, DWC_EP_TYPE_BULK, DWC_PID_DATA, buf,
					  length);
}

/* bulk transfer send data */
static int uhc_stm32_bulk_send_data(struct dev_priv_data *priv, uint8_t *buf, uint16_t length,
			      uint8_t pipe_num)
{
	return uhc_stm32_submit_transfer_req(priv, pipe_num, false, DWC_EP_TYPE_BULK, DWC_PID_DATA,
					  buf, length);
}

/* manage pipes based on device properties */
static int uhc_stm32_pipe_mngmt(struct dev_priv_data *priv)
{
	struct pipe_mng *pipe_info = &(priv->pipe_info);

	switch (pipe_info->request) {
	case USB_SREQ_SET_ADDRESS:
		(void)uhc_stm32_open_pipe(priv, DWC_DEFAULT_CTRL_PIPE_OUT, USB_EP_DIR_OUT,
			pipe_info->addr, DWC_DEVICE_SPEED_HIGH, DWC_EP_TYPE_CTRL, DWC_DEFAULT_MPS);
		(void)uhc_stm32_open_pipe(priv, DWC_DEFAULT_CTRL_PIPE_IN, USB_EP_DIR_IN,
			pipe_info->addr, DWC_DEVICE_SPEED_HIGH, DWC_EP_TYPE_CTRL, DWC_DEFAULT_MPS);
		break;
	default:
		break;
	}

	return 0;
}

/* set PID toggle value for a pipe */
static void set_pipe_PID_toggle(struct dev_priv_data *priv, uint8_t pipe, uint8_t toggle)
{
	if (priv->hch[pipe].ep_is_in) {
		priv->hch[pipe].toggle_in = toggle;
	} else {
		priv->hch[pipe].toggle_out = toggle;
	}
}

/* initiate a control transfer */
static int uhc_stm32_xfer_control(const struct device *dev, struct uhc_transfer *const xfer)
{
	struct dev_priv_data *priv = uhc_get_private(dev);
	struct net_buf *buf;
	struct usb_setup_packet *p_setup;

	buf = k_fifo_peek_head(&xfer->queue);
	if (buf == NULL) {
		LOG_ERR("No buffers to handle");
		return -ENODATA;
	}

	if (!uhc_xfer_is_queued(xfer) && xfer->setup) {
		LOG_ERR("No transfer queued");
		return -EINVAL;
	}

	if (!xfer->setup) {
		/* setup stage */
		p_setup = (struct usb_setup_packet *)buf->data;
		priv->desc_type = (uint8_t)(((uint16_t)p_setup->wValue) >> 8);
		priv->bRequest = p_setup->bRequest;
		if (priv->bRequest == USB_SREQ_CLEAR_FEATURE) {
			if (USB_EP_DIR_IS_IN(xfer->ep)) {
				set_pipe_PID_toggle(priv, DWC_DEFAULT_BULK_PIPE_IN,
						    DWC_HC_PID_DATA0);
				LOG_DBG("resetting IN toggle");
			} else {
				uint8_t toggle = priv->hch[DWC_DEFAULT_BULK_PIPE_OUT].toggle_out;

				set_pipe_PID_toggle(priv, DWC_DEFAULT_BULK_PIPE_OUT, 1 - toggle);
				set_pipe_PID_toggle(priv, DWC_DEFAULT_BULK_PIPE_IN,
						    DWC_HC_PID_DATA0);
				LOG_DBG("resetting IN/OUT toggle");
			}
		}
		(void)uhc_stm32_ctrl_send_setup(priv, buf->data, DWC_DEFAULT_CTRL_PIPE_OUT);
		priv->schedule = true;
		uhc_xfer_setup(xfer);
		uhc_xfer_queued(xfer);
		if (priv->bRequest == USB_SREQ_SET_ADDRESS) {
			priv->pipe_info.addr = (uint8_t)p_setup->wValue;
			priv->pipe_info.request = p_setup->bRequest;
			priv->pipe_info.desc_type = priv->desc_type;
			priv->pipe_info.data_change = true;
		}

		return 0;
	}

	if (buf->size != 0) {
		/* data stage */
		uint8_t *data;
		size_t length;

		if (USB_EP_DIR_IS_IN(xfer->ep)) {
			length = MIN(net_buf_tailroom(buf), xfer->mps);
			data = net_buf_tail(buf);
			(void)uhc_stm32_ctrl_receive_data(priv, data, length, DWC_DEFAULT_CTRL_PIPE_IN);
		} else {
			length = MIN(buf->len, xfer->mps);
			data = buf->data;
			(void)uhc_stm32_ctrl_send_data(priv, data, length, DWC_DEFAULT_CTRL_PIPE_OUT);
		}

		priv->schedule = true;
	} else {
		/* status stage */
		if (USB_EP_DIR_IS_IN(xfer->ep)) {
			(void)uhc_stm32_ctrl_send_data(priv, NULL, 0, DWC_DEFAULT_CTRL_PIPE_OUT);
		} else {
			(void)uhc_stm32_ctrl_receive_data(priv, NULL, 0, DWC_DEFAULT_CTRL_PIPE_IN);
		}

		if (priv->pipe_info.data_change) {
			priv->pipe_info.data_change = false;
			(void)uhc_stm32_pipe_mngmt(priv);
		}
	}

	return 0;
}

/* initiate a bulk transfer */
static int uhc_stm32_xfer_bulk(const struct device *dev, struct uhc_transfer *const xfer)
{
	struct dev_priv_data *priv = uhc_get_private(dev);
	struct net_buf *buf;
	uint8_t *data;
	size_t length;

	buf = k_fifo_peek_head(&xfer->queue);
	if (buf == NULL) {
		LOG_ERR("No buffers to handle");
		return -ENODATA;
	}

	if (USB_EP_DIR_IS_IN(xfer->ep)) {
		length = net_buf_tailroom(buf);
		data = net_buf_tail(buf);
		(void)uhc_stm32_bulk_receive_data(priv, data, length, DWC_DEFAULT_BULK_PIPE_IN);
	} else {
		length = buf->len;
		data = buf->data;
		(void)uhc_stm32_bulk_send_data(priv, data, length, DWC_DEFAULT_BULK_PIPE_OUT);
	}

	uhc_xfer_queued(xfer);

