faloj/zephyr/drivers/usb/uhc/uhc_dwc_stm32.c
	return 0;
}

/* schedule a transfer */
static int uhc_stm32_schedule_xfer(const struct device *dev)
{
	struct dev_priv_data *priv = uhc_get_private(dev);

	if (priv->last_xfer == NULL) {
		priv->last_xfer = uhc_xfer_get_next(dev);
		if (priv->last_xfer == NULL) {
			LOG_DBG("Nothing to transfer");
			return 0;
		}
	}

	if (USB_EP_GET_IDX(priv->last_xfer->ep) == 0) {
		priv->is_ctrl_xfer = true;
		return uhc_stm32_xfer_control(dev, priv->last_xfer);
	}

	return uhc_stm32_xfer_bulk(dev, priv->last_xfer);
}

/* handle transfer success event */
static int uhc_stm32_handle_xfr_success(const struct device *dev)
{
	struct dev_priv_data *priv = uhc_get_private(dev);
	struct uhc_transfer *const xfer = priv->last_xfer;
	struct net_buf *buf;

	buf = k_fifo_peek_head(&xfer->queue);
	if (buf == NULL) {
		LOG_ERR("Buffer is empty");
		return -ENODATA;
	}

	return uhc_xfer_done(xfer);
}

/* drop an active transfer */
static void uhc_stm32_xfer_drop_active(const struct device *dev, int err)
{
	struct dev_priv_data *priv = uhc_get_private(dev);

	if (priv->last_xfer) {
		uhc_xfer_return(dev, priv->last_xfer, err);
		priv->last_xfer = NULL;
	}
}

/* handle transfer complete event */
static int uhc_stm32_handle_xfrc(const struct device *dev)
{
	struct dev_priv_data *priv = uhc_get_private(dev);
	struct uhc_transfer *const xfer = priv->last_xfer;
	int ret;

	if (xfer == NULL) {
		LOG_ERR("No transfers to handle");
		return -ENODATA;
	}

	/* if an active xfer is not marked then something has gone wrong */
	if (!uhc_xfer_is_queued(xfer)) {
		LOG_ERR("Active transfer not queued");
		uhc_stm32_xfer_drop_active(dev, -EINVAL);
		return -EINVAL;
	}

	/* there should always be a buffer in the fifo when a xfer is active */
	if (k_fifo_is_empty(&xfer->queue)) {
		LOG_ERR("No buffers to handle");
		uhc_stm32_xfer_drop_active(dev, -ENODATA);
		return -ENODATA;
	}

	/* wait on transfer completion and update relevant state variables */
	ret = k_sem_take(&priv->xfr_event_sem, K_MSEC(CONFIG_USBH_XFER_SEM_TIMEOUT));
	if (ret || (priv->curr_state != DCW_URB_DONE)) {
		LOG_ERR("Transfer timed out");
		uhc_stm32_xfer_drop_active(dev, -ETIMEDOUT);
		return -ETIMEDOUT;
	}
	xfer->xfer_state = priv->curr_state;
	priv->curr_state = DCW_URB_IDLE;

	ret = uhc_stm32_handle_xfr_success(dev);
	if (ret) {
		uhc_stm32_xfer_drop_active(dev, ret);
		return 0;
	}

	if (k_fifo_is_empty(&xfer->queue)) {
		uhc_xfer_return(dev, xfer, 0);
		priv->last_xfer = NULL;
	}

	return 0;
}

/* thread to handle transfers */
static void uhc_stm32_thread(const struct device *dev)
{
	struct dev_priv_data *priv = uhc_get_private(dev);
	int err;
	uint8_t count = 0;
	uint8_t total_stages = 1;
	bool total_stages_set = false;

	while (true) {
		k_sem_take(&priv->xfr_sem, K_FOREVER);
		count = 0;
		total_stages = 1;
		total_stages_set = false;

		while ((count < total_stages) && (priv->schedule)) {
			count++;
			priv->schedule = false;
			priv->is_ctrl_xfer = false;

			err = uhc_stm32_schedule_xfer(dev);
			if (unlikely(err)) {
				uhc_submit_event(dev, UHC_EVT_ERROR, err, NULL);
			}

			err = uhc_stm32_handle_xfrc(dev);
			if (err) {
				priv->schedule = false;
			}

			if ((priv->is_ctrl_xfer) && (!total_stages_set)) {
				total_stages = DWC_CTRL_STAGES_NUM;
				total_stages_set = true;
			}
		}
	}
}

/* enqueue a transfer */
static int uhc_stm32_enqueue(const struct device *dev, struct uhc_transfer *const xfer)
{
	struct dev_priv_data *priv = uhc_get_private(dev);

	priv->schedule = true;
	uhc_xfer_append(dev, xfer);
	k_sem_give(&priv->xfr_sem);

	return 0;
}

/* dequeue a transfer */
static int uhc_stm32_dequeue(const struct device *dev, struct uhc_transfer *const xfer)
{
	/* TODO */
	return 0;
}

/* open a pipe to communicate with the device */
static int uhc_stm32_pipe_open(const struct device *dev, uint8_t pipe_num, uint8_t ep_num,
			     uint8_t ep_type, uint16_t ep_mps)
{
	struct dev_priv_data *priv = uhc_get_private(dev);
	int ret_val =
		uhc_stm32_open_pipe(priv, pipe_num, ep_num, 1, DWC_DEVICE_SPEED_HIGH, ep_type, ep_mps);

	set_pipe_PID_toggle(priv, pipe_num, 0);
	return ret_val;
}

/* perform core reset */
static int uhc_stm32_core_reset(mem_addr_t base_addr)
{
	uint32_t reg_val = 0;

	/* wait for AHB master IDLE state. */
	if (!WAIT_FOR((sys_read32(base_addr + DWC_GRSTCTL_OFFSET) & BIT(DWC_GRSTCTL_AHBIDL)),
		DWC_TIMEOUT_VAL, k_busy_wait(1))) {
		return -ETIMEDOUT;
	}

	/* core soft reset */
	reg_val = sys_read32(base_addr + DWC_GRSTCTL_OFFSET);
	reg_val |= BIT(DWC_GRSTCTL_CSRST);
	sys_write32(reg_val, base_addr + DWC_GRSTCTL_OFFSET);
	if (!WAIT_FOR(!(sys_read32(base_addr + DWC_GRSTCTL_OFFSET) & BIT(DWC_GRSTCTL_CSRST)),
		DWC_TIMEOUT_VAL, k_busy_wait(1))) {
		return -ETIMEDOUT;
	}

	return 0;
}

/* flush tx FIFO */
static int uhc_stm32_flush_tx_fifo(mem_addr_t base_addr, uint8_t num)
{
	uint32_t reg_val = 0;

	/* wait for AHB master IDLE state. */
	if (!WAIT_FOR((sys_read32(base_addr + DWC_GRSTCTL_OFFSET) & BIT(DWC_GRSTCTL_AHBIDL)),
		DWC_TIMEOUT_VAL, k_busy_wait(1))) {
		return -ETIMEDOUT;
	}

	/* flush tx Fifo */
	reg_val = sys_read32(base_addr + DWC_GRSTCTL_OFFSET);
	reg_val = (BIT(DWC_GRSTCTL_TXFFLSH) | (num << DWC_GRSTCTL_TxF_NUM_BIT_0));
	sys_write32(reg_val, base_addr + DWC_GRSTCTL_OFFSET);
	if (!WAIT_FOR(!(sys_read32(base_addr + DWC_GRSTCTL_OFFSET) & BIT(DWC_GRSTCTL_TXFFLSH)),
		DWC_TIMEOUT_VAL, k_busy_wait(1))) {
		return -ETIMEDOUT;
	}

	return 0;
}

/* flush rx FIFO */
static int uhc_stm32_flush_rx_fifo(mem_addr_t base_addr)
{
	uint32_t reg_val = 0;

	/* wait for AHB master IDLE state. */
	if (!WAIT_FOR((sys_read32(base_addr + DWC_GRSTCTL_OFFSET) & BIT(DWC_GRSTCTL_AHBIDL)),
		DWC_TIMEOUT_VAL, k_busy_wait(1))) {
		return -ETIMEDOUT;
	}

	/* flush rx Fifo */
	reg_val = sys_read32(base_addr + DWC_GRSTCTL_OFFSET);
	reg_val = BIT(DWC_GRSTCTL_RXFFLSH);
	sys_write32(reg_val, base_addr + DWC_GRSTCTL_OFFSET);
	if (!WAIT_FOR(!(sys_read32(base_addr + DWC_GRSTCTL_OFFSET) & BIT(DWC_GRSTCTL_RXFFLSH)),
		DWC_TIMEOUT_VAL, k_busy_wait(1))) {
		return -ETIMEDOUT;
	}

