faloj/zephyr/drivers/usb/uhc/uhc_dwc_stm32.c
	return 0;
}

/* initialize registers for host mode */
static int uhc_stm32_reg_init(struct dev_priv_data *priv)
{
	uint32_t i = 0;
	int ret_val = 0;
	uint32_t reg_val = 0;
	mem_addr_t ch_addr = 0;

	/* disable global interrupt */
	reg_val = sys_read32(priv->base_addr + DWC_GAHBCFG_OFFSET);
	reg_val &= ~BIT(DWC_GAHBCFG_GINTMSK);
	sys_write32(reg_val, priv->base_addr + DWC_GAHBCFG_OFFSET);
#ifdef ULPI
	/* enable ULPI interface */
	reg_val = sys_read32(priv->base_addr + DWC_GUSBCFG_OFFSET);
	reg_val &= ~(BIT(DWC_GUSBCFG_TSDPS) | BIT(DWC_GUSBCFG_PHYSEL));
	sys_write32(reg_val, priv->base_addr + DWC_GUSBCFG_OFFSET);

	/* configure vbus */
	reg_val = sys_read32(priv->base_addr + DWC_GUSBCFG_OFFSET);
	reg_val &= ~(BIT(DWC_GUSBCFG_ULPIEVBUSD) | BIT(DWC_GUSBCFG_ULPIEVBUSI));
	sys_write32(reg_val, priv->base_addr + DWC_GUSBCFG_OFFSET);
#else
	/* enable ULPI interface */
	reg_val = sys_read32(priv->base_addr + DWC_GUSBCFG_OFFSET);
	reg_val |= BIT(DWC_GUSBCFG_PHYSEL);
	sys_write32(reg_val, priv->base_addr + DWC_GUSBCFG_OFFSET);
#endif
	ret_val = uhc_stm32_core_reset(priv->base_addr);
	if (ret_val) {
		return ret_val;
	}
#if 1
	/* enable dma */
	reg_val = sys_read32(priv->base_addr + DWC_GAHBCFG_OFFSET);
	reg_val |= DWC_GAHBCFG_HBSTLEN_INCR4;
	reg_val |= BIT(DWC_GAHBCFG_DMAEN);
	sys_write32(reg_val, priv->base_addr + DWC_GAHBCFG_OFFSET);
#endif
	/* set host mode */
	reg_val = sys_read32(priv->base_addr + DWC_GUSBCFG_OFFSET);
	reg_val &= ~(BIT(DWC_GUSBCFG_FHMOD) | BIT(DWC_GUSBCFG_FDMOD));
	reg_val |= BIT(DWC_GUSBCFG_FHMOD);
	sys_write32(reg_val, priv->base_addr + DWC_GUSBCFG_OFFSET);
	if (!WAIT_FOR((sys_read32(priv->base_addr + DWC_GINTSTS_OFFSET) & DWC_HOST_MODE),
		DWC_HOST_TIMEOUT_VAL, k_msleep(1))) {
		return -ETIMEDOUT;
	}

	/* restart PHY */
	reg_val = 0;
	sys_write32(reg_val, priv->base_addr + DWC_PCGCCTL_OFFSET);

	/* set default speed */
	reg_val = sys_read32(priv->base_addr + DWC_HCFG_OFFSET);
#ifdef HIGH_SPEED
	reg_val &= ~(BIT(DWC_HCFG_FSLS_SUPPORT));
#else
	reg_val |= (BIT(DWC_HCFG_FSLS_SUPPORT));
#endif
	sys_write32(reg_val, priv->base_addr + DWC_HCFG_OFFSET);

	/* flush FIFOs */
	ret_val = uhc_stm32_flush_tx_fifo(priv->base_addr, DWC_GRSTCTL_FLUSH_ALL_TXFIFO);
	if (ret_val) {
		return ret_val;
	}

	ret_val = uhc_stm32_flush_rx_fifo(priv->base_addr);
	if (ret_val) {
		return ret_val;
	}

	/* clear all host channel interrupts */
	for (i = 0; i < DWC_MAX_NBR_CH; i++) {
		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, i);
		reg_val = DWC_CLR_ALL_INTERRUPTS;
		sys_write32(reg_val, priv->base_addr + ch_addr);

		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINTMSK0_OFFSET, i);
		reg_val = 0;
		sys_write32(reg_val, priv->base_addr + ch_addr);
	}

	/* disable all interrupts */
	reg_val = 0;
	sys_write32(reg_val, priv->base_addr + DWC_GINTMSK_OFFSET);

	/* clear all interrupt status */
	reg_val = DWC_CLR_ALL_INTERRUPTS;
	sys_write32(reg_val, priv->base_addr + DWC_GINTSTS_OFFSET);

	/* configure FIFO sizes */
	reg_val = DWC_RxFDep;
	sys_write32(reg_val, priv->base_addr + DWC_GRXFSIZ_OFFSET);
	reg_val = ((DWC_NPTxFDep << DWC_NPTxFDep_Bit0_pos) | DWC_NPTxStAddr);
	sys_write32(reg_val, priv->base_addr + DWC_GNPTXFSIZ_OFFSET);
	reg_val = ((DWC_HPTxFDep << DWC_HPTxFDep_Bit0_pos) | DWC_HPTxStAddr);
	sys_write32(reg_val, priv->base_addr + DWC_HPTXFSIZ_OFFSET);

	/* enable all host mode interrupts */
	reg_val = sys_read32(priv->base_addr + DWC_GINTMSK_OFFSET);
	reg_val |= (BIT(DWC_GINTx_HPRTINT) | BIT(DWC_GINTx_HCINT) | BIT(DWC_GINTx_SOF) |
		    BIT(DWC_GINTx_DISCINT) | BIT(DWC_GINTx_INCOMPLP) | BIT(DWC_GINTx_WKUPINT));
	sys_write32(reg_val, priv->base_addr + DWC_GINTMSK_OFFSET);

	return ret_val;
}

/* configure VBUS to enable or disable power on port */
static int uhc_configure_vbus(const struct device *dev, mem_addr_t base_addr, bool enable_flag)
{
	const struct uhc_cfg *config = dev->config;

	uint32_t reg_val = 0;

	reg_val = sys_read32(base_addr + DWC_HPRT_OFFSET);
	reg_val &= ~(BIT(DWC_HPRT_PORT_EN) | BIT(DWC_HPRT_PORT_CONN_DET) |
		     BIT(DWC_HPRT_PORT_ENCHNG) | BIT(DWC_HPRT_PORT_OCCHNG));

	if (((reg_val & BIT(DWC_HPRT_PORT_PWR)) == 0U) && enable_flag) {
		LOG_DBG("port powered");
		reg_val = (BIT(DWC_HPRT_PORT_PWR) | reg_val);
		sys_write32(reg_val, base_addr + DWC_HPRT_OFFSET);
	}
	if (((reg_val & BIT(DWC_HPRT_PORT_PWR)) == BIT(DWC_HPRT_PORT_PWR)) && (!enable_flag)) {
		LOG_DBG("port unpowered");
		reg_val = ((~BIT(DWC_HPRT_PORT_PWR)) & reg_val);
		sys_write32(reg_val, base_addr + DWC_HPRT_OFFSET);
	}

	if (config->vbus_enable_gpio.port) {
		int err = 0;

		if (enable_flag) {
			err = gpio_pin_set_dt(&config->vbus_enable_gpio, 1);
		} else {
			err = gpio_pin_set_dt(&config->vbus_enable_gpio, 0);
		}

		if (err) {
			LOG_ERR("Failed to enable vbus power (%d)", err);
			return err;
		}
	}

	return 0;
}

/* check for spurious USB interrupts */
static uint32_t uhc_check_spurious_interrupt(mem_addr_t base_addr)
{
	uint32_t reg_val;

	reg_val = sys_read32(base_addr + DWC_GINTSTS_OFFSET);
	reg_val &= sys_read32(base_addr + DWC_GINTMSK_OFFSET);

	return reg_val;
}

/* reset host */
static int uhc_stm32_reset_host(mem_addr_t base_addr)
{
	uint32_t i;
	int ret_val = 0;
	uint32_t reg_val = 0;
	mem_addr_t ch_addr = 0;

	/* disable global interrupt */
	reg_val = sys_read32(base_addr + DWC_GAHBCFG_OFFSET);
	reg_val &= ~BIT(DWC_GAHBCFG_GINTMSK);
	sys_write32(reg_val, base_addr + DWC_GAHBCFG_OFFSET);

	/* flush FIFOs */
	ret_val = uhc_stm32_flush_tx_fifo(base_addr, DWC_GRSTCTL_FLUSH_ALL_TXFIFO);
	if (ret_val) {
		return ret_val;
	}

	ret_val = uhc_stm32_flush_rx_fifo(base_addr);
	if (ret_val) {
		return ret_val;
	}

	/* flush queued requests */
	for (i = 0; i < DWC_MAX_NBR_CH; i++) {
		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCCHAR0_OFFSET, i);
		reg_val = sys_read32(base_addr + ch_addr);
		reg_val |= BIT(DWC_HCCHARx_CHDIS);
		reg_val &= ~BIT(DWC_HCCHARx_CHENA);
		reg_val &= ~BIT(DWC_HCCHARx_EPDIR);
		sys_write32(reg_val, base_addr + ch_addr);
	}

	/* halt all channels to put them into a known state */
	for (i = 0; i < DWC_MAX_NBR_CH; i++) {
		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCCHAR0_OFFSET, i);
		reg_val = sys_read32(base_addr + ch_addr);
		reg_val |= BIT(DWC_HCCHARx_CHDIS);
		reg_val &= ~BIT(DWC_HCCHARx_EPDIR);
		sys_write32(reg_val, base_addr + ch_addr);

		if (!WAIT_FOR(!(sys_read32(base_addr + ch_addr) & BIT(DWC_HCCHARx_CHENA)),
			DWC_TIMEOUT_VAL, k_busy_wait(1))) {
			return -ETIMEDOUT;
		}

		reg_val = sys_read32(base_addr + ch_addr);
		reg_val |= BIT(DWC_HCCHARx_CHENA);
		sys_write32(reg_val, base_addr + ch_addr);
	}

