faloj/zephyr/drivers/usb/uhc/uhc_dwc_stm32.c
	/* clear pending interrupts */
	reg_val = DWC_CLR_ALL_INTERRUPTS;
	sys_write32(reg_val, base_addr + DWC_HAINT_OFFSET);
	reg_val = DWC_CLR_ALL_INTERRUPTS;
	sys_write32(reg_val, base_addr + DWC_GINTSTS_OFFSET);

	/* enable global interrupt */
	reg_val = sys_read32(base_addr + DWC_GAHBCFG_OFFSET);
	reg_val |= BIT(DWC_GAHBCFG_GINTMSK);
	sys_write32(reg_val, base_addr + DWC_GAHBCFG_OFFSET);

	return ret_val;
}

/* ISR routine to handle port events */
static int uhc_isr_port_handler(struct device *dev)
{
	struct dev_priv_data *priv = uhc_get_private(dev);
	mem_addr_t base_addr = priv->base_addr;
	uint32_t hprt;
	uint32_t hprt_dup;
	uint32_t reg_val = 0;

	hprt = sys_read32(base_addr + DWC_HPRT_OFFSET);
	hprt_dup = sys_read32(base_addr + DWC_HPRT_OFFSET);

	hprt_dup &= ~(BIT(DWC_HPRT_PORT_EN) | BIT(DWC_HPRT_PORT_CONN_DET) |
		      BIT(DWC_HPRT_PORT_ENCHNG) | BIT(DWC_HPRT_PORT_OCCHNG));

	/* handle port connected event */
	if (DWC_INTERRUPT_CHECK_SOURCE(hprt, BIT(DWC_HPRT_PORT_CONN_DET))) {
		LOG_DBG("device connected to port");
		if (DWC_INTERRUPT_CHECK_SOURCE(hprt, BIT(DWC_HPRT_PORT_CONN_STS))) {
			LOG_DBG("device status is also set");
			priv->device_connected = true;
			uhc_submit_event(dev, UHC_EVT_DEV_CONNECTED_HS, 0, NULL);
		}
		hprt_dup |= BIT(DWC_HPRT_PORT_CONN_DET);
	}

	/* handle port enable change event */
	if (DWC_INTERRUPT_CHECK_SOURCE(hprt, BIT(DWC_HPRT_PORT_ENCHNG))) {
		LOG_DBG("port enable change bit is set");
		hprt_dup |= BIT(DWC_HPRT_PORT_ENCHNG);

		if (DWC_INTERRUPT_CHECK_SOURCE(hprt, BIT(DWC_HPRT_PORT_EN))) {
			LOG_DBG("port enable bit is set");
			if ((sys_read32(base_addr + DWC_HPRT_OFFSET) & DWC_HPRT_PORT_SPD_MSK) ==
			    DWC_HPRT_PORT_SPD_FS) {
				LOG_DBG("attached device is a full speed one");
				reg_val = DWC_HFIR_FRAME_INTERVAL_FS;
				sys_write32(reg_val, base_addr + DWC_HFIR_OFFSET);
			}

			priv->port_enabled = true;
		} else {
			priv->port_enabled = false;
		}
	}

	/* handle overcurrent event */
	if (DWC_INTERRUPT_CHECK_SOURCE(hprt, BIT(DWC_HPRT_PORT_OCCHNG))) {
		LOG_DBG("overcurrent detected on port");
		hprt_dup |= BIT(DWC_HPRT_PORT_OCCHNG);
	}

	/* clear port interrupts */
	sys_write32(hprt_dup, base_addr + DWC_HPRT_OFFSET);

	return 0;
}

/* ISR routine to handle channel IN interrupts */
static int uhc_isr_channel_in_handler(struct dev_priv_data *priv, uint32_t ch_num)
{
	mem_addr_t base_addr = priv->base_addr;
	uint32_t reg_val = 0;
	uint32_t hcintmsk = 0;
	mem_addr_t ch_addr = 0;
	volatile uint64_t count = 0;

	ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
	reg_val = sys_read32(base_addr + ch_addr);

	if (DWC_INTERRUPT_CHECK_SOURCE(reg_val, BIT(DWC_HCINTx_CHH))) {
		if (DWC_INTERRUPT_CHECK_SOURCE(reg_val, BIT(DWC_HCINTx_XFRC))) {
			priv->hch[ch_num].err_cnt = 0U;

			ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINTMSK0_OFFSET, ch_num);
			hcintmsk = sys_read32(base_addr + ch_addr);
			hcintmsk |= BIT(DWC_HCINTMSKx_ACK);
			sys_write32(hcintmsk, base_addr + ch_addr);

			ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
			sys_write32(BIT(DWC_HCINTx_XFRC), base_addr + ch_addr);

			if ((priv->hch[ch_num].xfer_sz / priv->hch[ch_num].max_packet) & 1U) {
				priv->hch[ch_num].toggle_in ^= 1U;
			}

			uhc_stm32_hch_halt(priv, ch_num);
			priv->hch[ch_num].state = DWC_HC_XFRC;
		} else if (DWC_INTERRUPT_CHECK_SOURCE(reg_val, BIT(DWC_HCINTx_BBERR))) {
			priv->hch[ch_num].err_cnt = 0U;

			ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINTMSK0_OFFSET, ch_num);
			hcintmsk = sys_read32(base_addr + ch_addr);
			hcintmsk |= BIT(DWC_HCINTMSKx_ACK);
			sys_write32(hcintmsk, base_addr + ch_addr);

			ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
			sys_write32(BIT(DWC_HCINTx_BBERR), base_addr + ch_addr);

			uhc_stm32_hch_halt(priv, ch_num);
		} else if (DWC_INTERRUPT_CHECK_SOURCE(reg_val, BIT(DWC_HCINTx_STALL))) {
			priv->hch[ch_num].err_cnt = 0U;

			ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINTMSK0_OFFSET, ch_num);
			hcintmsk = sys_read32(base_addr + ch_addr);
			hcintmsk |= BIT(DWC_HCINTMSKx_ACK);
			sys_write32(hcintmsk, base_addr + ch_addr);

			ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
			sys_write32(BIT(DWC_HCINTx_STALL), base_addr + ch_addr);

			uhc_stm32_hch_halt(priv, ch_num);
		} else if (DWC_INTERRUPT_CHECK_SOURCE(reg_val, BIT(DWC_HCINTx_TXERR))) {
			if (priv->hch[ch_num].err_cnt >= 2) {
				uhc_stm32_hch_halt(priv, ch_num);
			} else {
				ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINTMSK0_OFFSET, ch_num);
				hcintmsk = sys_read32(base_addr + ch_addr);

				hcintmsk &= ~BIT(DWC_HCINTMSKx_ACK);
				hcintmsk &= ~BIT(DWC_HCINTMSKx_NAK);
				hcintmsk &= ~BIT(DWC_HCINTMSKx_DTERR);
				sys_write32(hcintmsk, base_addr + ch_addr);

				priv->hch[ch_num].err_cnt++;

				/* re-activate the channel */
				ch_addr = DWC_CHx_REG_OFFSET(DWC_HCCHAR0_OFFSET, ch_num);
				reg_val = sys_read32(base_addr + ch_addr);
				reg_val &= ~BIT(DWC_HCCHARx_CHDIS);
				reg_val |= BIT(DWC_HCCHARx_CHENA);
				sys_write32(reg_val, base_addr + ch_addr);
			}

			ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
			sys_write32(BIT(DWC_HCINTx_TXERR), base_addr + ch_addr);
		}

		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
		sys_write32(BIT(DWC_HCINTx_CHH), base_addr + ch_addr);

		if (priv->hch[ch_num].state == DWC_HC_XFRC) {
			priv->curr_state = DCW_URB_DONE;
			k_sem_give(&priv->xfr_event_sem);
		}
	} else if (DWC_INTERRUPT_CHECK_SOURCE(reg_val, BIT(DWC_HCINTx_ACK))) {
		priv->hch[ch_num].err_cnt = 0U;

		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINTMSK0_OFFSET, ch_num);
		hcintmsk = sys_read32(base_addr + ch_addr);
		hcintmsk |= BIT(DWC_HCINTMSKx_ACK);
		sys_write32(hcintmsk, base_addr + ch_addr);

		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
		sys_write32(BIT(DWC_HCINTx_ACK), base_addr + ch_addr);
	} else if (DWC_INTERRUPT_CHECK_SOURCE(reg_val, BIT(DWC_HCINTx_NAK))) {
		do {
			count++;
		} while (count < DWC_NAK_TIMEOUT_VAL);
		priv->hch[ch_num].err_cnt = 0U;

		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINTMSK0_OFFSET, ch_num);
		hcintmsk = sys_read32(base_addr + ch_addr);
		hcintmsk |= BIT(DWC_HCINTMSKx_NAK);
		sys_write32(hcintmsk, base_addr + ch_addr);

