faloj/zephyr/drivers/usb/uhc/uhc_dwc_stm32.c
		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
		sys_write32(BIT(DWC_HCINTx_NAK), base_addr + ch_addr);
	} else if (DWC_INTERRUPT_CHECK_SOURCE(reg_val, BIT(DWC_HCINTx_DTERR))) {
		priv->hch[ch_num].err_cnt = 0U;

		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINTMSK0_OFFSET, ch_num);
		hcintmsk = sys_read32(base_addr + ch_addr);
		hcintmsk |= BIT(DWC_HCINTMSKx_DTERR);
		sys_write32(hcintmsk, base_addr + ch_addr);

		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
		sys_write32(BIT(DWC_HCINTx_DTERR), base_addr + ch_addr);
	} else if (DWC_INTERRUPT_CHECK_SOURCE(reg_val, BIT(DWC_HCINTx_AHBERR))) {
		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
		sys_write32(BIT(DWC_HCINTx_AHBERR), base_addr + ch_addr);
		uhc_stm32_hch_halt(priv, ch_num);
	} else if (DWC_INTERRUPT_CHECK_SOURCE(reg_val, BIT(DWC_HCINTx_FRMOR))) {
		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
		sys_write32(BIT(DWC_HCINTx_FRMOR), base_addr + ch_addr);
		uhc_stm32_hch_halt(priv, ch_num);
	}

	return 0;
}

/* ISR routine to handle channel OUT interrupts */
static int uhc_isr_channel_out_handler(struct dev_priv_data *priv, uint32_t ch_num)
{
	mem_addr_t base_addr = priv->base_addr;
	uint32_t num_packets;
	uint32_t reg_val = 0;
	mem_addr_t ch_addr = 0;
	uint32_t hcintmsk = 0;

	ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
	reg_val = sys_read32(base_addr + ch_addr);

	if (DWC_INTERRUPT_CHECK_SOURCE(reg_val, BIT(DWC_HCINTx_CHH))) {
		if (DWC_INTERRUPT_CHECK_SOURCE(reg_val, BIT(DWC_HCINTx_XFRC))) {
			priv->hch[ch_num].err_cnt = 0U;

			ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINTMSK0_OFFSET, ch_num);
			hcintmsk = sys_read32(base_addr + ch_addr);
			hcintmsk |= BIT(DWC_HCINTx_ACK);
			sys_write32(hcintmsk, base_addr + ch_addr);

			ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
			sys_write32(BIT(DWC_HCINTx_XFRC), base_addr + ch_addr);

			if (DWC_INTERRUPT_CHECK_SOURCE(reg_val, BIT(DWC_HCINTx_NYET))) {
				sys_write32(BIT(DWC_HCINTx_NYET), base_addr + ch_addr);
			}

			uhc_stm32_hch_halt(priv, ch_num);
			priv->hch[ch_num].state = DWC_HC_XFRC;
		} else if (DWC_INTERRUPT_CHECK_SOURCE(reg_val, BIT(DWC_HCINTx_STALL))) {
			priv->hch[ch_num].err_cnt = 0U;

			ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINTMSK0_OFFSET, ch_num);
			hcintmsk = sys_read32(base_addr + ch_addr);
			hcintmsk |= BIT(DWC_HCINTx_ACK);
			sys_write32(hcintmsk, base_addr + ch_addr);

			ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
			sys_write32(BIT(DWC_HCINTx_STALL), base_addr + ch_addr);

			uhc_stm32_hch_halt(priv, ch_num);
		} else if (DWC_INTERRUPT_CHECK_SOURCE(reg_val, BIT(DWC_HCINTx_TXERR))) {
			if (priv->hch[ch_num].err_cnt >= 2) {
				uhc_stm32_hch_halt(priv, ch_num);
			} else {
				priv->hch[ch_num].err_cnt++;

				/* re-activate the channel */
				ch_addr = DWC_CHx_REG_OFFSET(DWC_HCCHAR0_OFFSET, ch_num);
				reg_val = sys_read32(base_addr + ch_addr);
				reg_val &= ~BIT(DWC_HCCHARx_CHDIS);
				reg_val |= BIT(DWC_HCCHARx_CHENA);
				sys_write32(reg_val, base_addr + ch_addr);
			}

			ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
			sys_write32(BIT(DWC_HCINTx_TXERR), base_addr + ch_addr);
		}

		if (priv->hch[ch_num].ep_type == DWC_EP_TYPE_BULK) {
			if (priv->hch[ch_num].xfer_len > 0U) {
				num_packets = (priv->hch[ch_num].xfer_len +
						priv->hch[ch_num].max_packet - 1U) /
						priv->hch[ch_num].max_packet;

				if ((num_packets & 1U) != 0U) {
					priv->hch[ch_num].toggle_out ^= 1U;
				}
			}
		}

		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
		sys_write32(BIT(DWC_HCINTx_CHH), base_addr + ch_addr);

		if (priv->hch[ch_num].state == DWC_HC_XFRC) {
			priv->curr_state = DCW_URB_DONE;
			k_sem_give(&priv->xfr_event_sem);
		}
	} else if (DWC_INTERRUPT_CHECK_SOURCE(reg_val, BIT(DWC_HCINTx_ACK))) {
		priv->hch[ch_num].err_cnt = 0U;

		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINTMSK0_OFFSET, ch_num);
		hcintmsk = sys_read32(base_addr + ch_addr);
		hcintmsk |= BIT(DWC_HCINTx_ACK);
		sys_write32(hcintmsk, base_addr + ch_addr);

		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
		sys_write32(BIT(DWC_HCINTx_ACK), base_addr + ch_addr);
	} else if (DWC_INTERRUPT_CHECK_SOURCE(reg_val, BIT(DWC_HCINTx_AHBERR))) {
		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
		sys_write32(BIT(DWC_HCINTx_AHBERR), base_addr + ch_addr);
		uhc_stm32_hch_halt(priv, ch_num);
	} else if (DWC_INTERRUPT_CHECK_SOURCE(reg_val, BIT(DWC_HCINTx_FRMOR))) {
		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
		sys_write32(BIT(DWC_HCINTx_FRMOR), base_addr + ch_addr);
		uhc_stm32_hch_halt(priv, ch_num);
	} else if (DWC_INTERRUPT_CHECK_SOURCE(reg_val, BIT(DWC_HCINTx_DTERR))) {
		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
		sys_write32(BIT(DWC_HCINTx_DTERR), base_addr + ch_addr);
		uhc_stm32_hch_halt(priv, ch_num);
	} else if (DWC_INTERRUPT_CHECK_SOURCE(reg_val, BIT(DWC_HCINTx_BBERR))) {
		ch_addr = DWC_CHx_REG_OFFSET(DWC_HCINT0_OFFSET, ch_num);
		sys_write32(BIT(DWC_HCINTx_BBERR), base_addr + ch_addr);
		uhc_stm32_hch_halt(priv, ch_num);
	}

	return 0;
}

/* Global ISR routine to handle all interrupt events */
static void uhc_stm32_isr_handler(struct device *dev)
{
	struct dev_priv_data *priv = uhc_get_private(dev);
	mem_addr_t base_addr = priv->base_addr;
	uint32_t reg_val = 0;
	uint32_t gintsts_val = 0;
	uint32_t gintmsk_val = 0;
	mem_addr_t ch_addr = 0;

	reg_val = sys_read32(base_addr + DWC_GINTSTS_OFFSET);
	gintsts_val = sys_read32(base_addr + DWC_GINTSTS_OFFSET);
	gintmsk_val = sys_read32(base_addr + DWC_GINTMSK_OFFSET);
	/* handles only host-mode interrupts */
	if ((reg_val & DWC_GINTSTS_CURR_MOD) == DWC_HOST_MODE) {
		/* check for spurious interrupts */
		if (!(uhc_check_spurious_interrupt(base_addr))) {
			LOG_DBG("spurious interrupt detected");
			return;
		}

		/* clear miscellaneous interrupt flags */
		if (DWC_GLOBAL_INTERRUPT_CHECK_SOURCE(gintsts_val, gintmsk_val,
						      BIT(DWC_GINTx_INCOMPLP))) {
			sys_write32(BIT(DWC_GINTx_INCOMPLP), base_addr + DWC_GINTSTS_OFFSET);
			LOG_DBG("incomplete periodic transfer interrupt detected");
			return;
		}

		if (DWC_GLOBAL_INTERRUPT_CHECK_SOURCE(gintsts_val, gintmsk_val,
						      BIT(DWC_GINTx_PTXFE))) {
			sys_write32(BIT(DWC_GINTx_PTXFE), base_addr + DWC_GINTSTS_OFFSET);
			LOG_DBG("periodic transfer FIFO empty interrupt detected");
			return;
		}

		if (DWC_GLOBAL_INTERRUPT_CHECK_SOURCE(gintsts_val, gintmsk_val,
						      BIT(DWC_GINTx_MMIS))) {
			sys_write32(BIT(DWC_GINTx_MMIS), base_addr + DWC_GINTSTS_OFFSET);
			LOG_DBG("mode mismatch interrupt detected");
			return;
		}

		/* handle device disconnect interrupt */
		if (DWC_GLOBAL_INTERRUPT_CHECK_SOURCE(gintsts_val, gintmsk_val,
						      BIT(DWC_GINTx_DISCINT))) {
			sys_write32(BIT(DWC_GINTx_DISCINT), base_addr + DWC_GINTSTS_OFFSET);
			LOG_DBG("device disconnect interrupt detected");

			if ((sys_read32(base_addr + DWC_HPRT_OFFSET) &
			     BIT(DWC_HPRT_PORT_CONN_STS)) == 0U) {
				LOG_DBG("device status is still set");

				/* reset device and port state variables */
				priv->device_connected = false;
				priv->port_enabled = false;

				/* reset PHY clock select */
				reg_val = sys_read32(base_addr + DWC_HCFG_OFFSET);
				reg_val &= ~(BIT(DWC_HCFG_FSLSPclkSel));
				reg_val |= (1 & BIT(DWC_HCFG_FSLSPclkSel));
				sys_write32(reg_val, base_addr + DWC_HCFG_OFFSET);
				reg_val = DWC_HFIR_FRAME_INTERVAL;
				sys_write32(reg_val, base_addr + DWC_HFIR_OFFSET);

				/* reset host and submit event to core layer */
				uhc_stm32_reset_host(base_addr);
				uhc_submit_event(dev, UHC_EVT_DEV_REMOVED, 0, NULL);

				/* interrupt the current transfer, if any */
				priv->curr_state = DCW_URB_ERROR;
				k_sem_give(&priv->xfr_event_sem);
			}
		}

		/* handle host port interrupts */
		if (DWC_GLOBAL_INTERRUPT_CHECK_SOURCE(gintsts_val, gintmsk_val,
						      BIT(DWC_GINTx_HPRTINT))) {
			uhc_isr_port_handler(dev);
		}

		/* handle SOF interrupt */
		if (DWC_GLOBAL_INTERRUPT_CHECK_SOURCE(gintsts_val, gintmsk_val,
						      BIT(DWC_GINTx_SOF))) {
			sys_write32(BIT(DWC_GINTx_SOF), base_addr + DWC_GINTSTS_OFFSET);
		}

		/* handle Rx FIFO interrupts */
		if ((DWC_GLOBAL_INTERRUPT_CHECK_SOURCE(gintsts_val, gintmsk_val,
						       BIT(DWC_GINTx_RXFLVL))) != 0U) {
			/* Mask the interrupt */
			reg_val = sys_read32(base_addr + DWC_GINTMSK_OFFSET);
			reg_val &= ~BIT(DWC_GINTx_RXFLVL);
			sys_write32(reg_val, base_addr + DWC_GINTMSK_OFFSET);

			/* Unmask the interrupt */
			reg_val = sys_read32(base_addr + DWC_GINTMSK_OFFSET);
			reg_val |= BIT(DWC_GINTx_RXFLVL);
			sys_write32(reg_val, base_addr + DWC_GINTMSK_OFFSET);
		}

		/* handle host channel interrupts */
		if (DWC_GLOBAL_INTERRUPT_CHECK_SOURCE(gintsts_val, gintmsk_val,
						      BIT(DWC_GINTx_HCINT))) {
			uint32_t i = 0;
			uint32_t interrupt = 0;

			/* read all host channel interrupt status */
			reg_val = sys_read32(base_addr + DWC_HAINT_OFFSET);
			interrupt = (reg_val & 0xFFFFU);
			for (i = 0U; i < DWC_MAX_NBR_CH; i++) {
				if ((interrupt & (1UL << (i & 0xFU))) != 0U) {
					ch_addr = DWC_CHx_REG_OFFSET(DWC_HCCHAR0_OFFSET, i);
					if ((sys_read32(base_addr + ch_addr) &
					     BIT(DWC_HCCHARx_EPDIR)) == BIT(DWC_HCCHARx_EPDIR)) {
						uhc_isr_channel_in_handler(priv, (uint8_t)i);
					} else {
						uhc_isr_channel_out_handler(priv, (uint8_t)i);
					}
				}
			}
			sys_write32(BIT(DWC_GINTx_HCINT), base_addr + DWC_GINTSTS_OFFSET);
		}
	}
}

