faloj/zephyr/drivers/usb/uhc/uhc_dwc_stm32.c
/*
 * This function performs reset for a USB controller (assert + deassert).
 */
static int uhc_stm32_reset_config(const struct reset_dt_spec *reset_spec)
{
	int ret = 0;

	if (!device_is_ready(reset_spec->dev)) {
		LOG_ERR("USB reset controller device not ready");
		return -ENODEV;
	}

	ret = reset_line_toggle(reset_spec->dev, reset_spec->id);
	if (ret != 0) {
		LOG_ERR("USB reset failed");
	}

	return ret;
}

/* TODO : Factorize if possible. priv_clock_enable and priv_clock_disable are just a slightly
 * modified version taken from udc_stm32.c (under Copyright (c) 2023 Linaro Limited)
 */
/***********************************************************************/
static int priv_clock_enable(const struct device *dev)
{
	const struct uhc_cfg *config = dev->config;
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

	if (!device_is_ready(clk)) {
		LOG_ERR("clock control device not ready");
		return -ENODEV;
	}

	if (DT_INST_NUM_CLOCKS(0) > 1) {
		if (clock_control_configure(clk, (clock_control_subsys_t *)&config->clocks[1],
					    NULL) != 0) {
			LOG_ERR("Could not select USB domain clock");
			return -EIO;
		}
	}

	if (clock_control_on(clk, (clock_control_subsys_t *)&config->clocks[0]) != 0) {
		LOG_ERR("Unable to enable USB clock");
		return -EIO;
	}

	uint32_t usb_clock_rate;

	if (clock_control_get_rate(clk, (clock_control_subsys_t *)&config->clocks[1],
				   &usb_clock_rate) != 0) {
		LOG_ERR("Failed to get USB domain clock rate");
		return -EIO;
	}

	if (usb_clock_rate != MHZ(48)) {
		LOG_ERR("USB Clock is not 48MHz (%d)", usb_clock_rate);
		return -ENOTSUP;
	}


/* TODO : check if usefull */
/* Previous check won't work in case of F1. Add build time check */
#if defined(RCC_CFGR_OTGFSPRE) || defined(RCC_CFGR_USBPRE)

#if (MHZ(48) == CONFIG_SYS_CLOCK_HW_CYCLES_PER_SEC) && !defined(STM32_PLL_USBPRE)
/* PLL output clock is set to 48MHz, it should not be divided */
#warning USBPRE/OTGFSPRE should be set in rcc node
#endif

#endif /* RCC_CFGR_OTGFSPRE / RCC_CFGR_USBPRE */

	return 0;
}

static int priv_clock_disable(const struct device *dev)
{
	const struct uhc_cfg *config = dev->config;
	const struct device *clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

	if (clock_control_off(clk, (clock_control_subsys_t *)&config->clocks[0]) != 0) {
		LOG_ERR("Unable to disable USB clock");
		return -EIO;
	}

	return 0;
}
/**********************************************************************/

/* initialize core for host mode */
static int uhc_stm32_init(const struct device *dev)
{
	const struct uhc_cfg *config = dev->config;
	uint32_t reg_val = 0;
	int ret_val = 0;
	struct dev_priv_data *priv;

	if (!dev) {
		LOG_ERR("device not found");
		return -ENODEV;
	}

	priv = uhc_get_private(dev);

	/* controller state init */
	priv->device_connected = false;
	priv->port_enabled = false;

#ifndef ULPI
	/* TODO: useless with an ULPI phy ? */
	LL_PWR_EnableUSBVoltageDetector();
	while (LL_PWR_IsActiveFlag_USB() == 0) {
		;
	}
#endif

	ret_val = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_DEFAULT);

	if (ret_val != 0) {
		LOG_ERR("USB pinctrl setup failed (%d)", ret_val);
		return ret_val;
	}

	if (config->vbus_enable_gpio.port) {
		if (!gpio_is_ready_dt(&config->vbus_enable_gpio)) {
			LOG_ERR("vbus enable gpio not ready");
			return -ENODEV;
		}
		ret_val = gpio_pin_configure_dt(&config->vbus_enable_gpio, GPIO_OUTPUT_INACTIVE);
		if (ret_val != 0) {
			LOG_ERR("Failed to configure vbus enable gpio (%d)", ret_val);
			return ret_val;
		}
	}

	ret_val = priv_clock_enable(dev);

	if (ret_val != 0) {
		LOG_ERR("Error enabling clock(s)");
		return -EIO;
	}

	/* initialize registers */
	priv->base_addr = DEVICE_MMIO_GET(dev);
	ret_val = uhc_stm32_reg_init(priv);
	if (ret_val) {
		LOG_ERR("USB register initialization failed (%d)", ret_val);
		return ret_val;
	}

	/* configure vbus */
	uhc_configure_vbus(dev, priv->base_addr, true);

	/* configure ISR handler and enable irq */
	IRQ_CONNECT(DT_INST_IRQN(0), DT_INST_IRQ(0, priority), uhc_stm32_isr_handler,
		    DEVICE_DT_INST_GET(0), 0);
	irq_enable(DT_INST_IRQN(0));

	/* enable global interrupt */
	reg_val = sys_read32(priv->base_addr + DWC_GAHBCFG_OFFSET);
	reg_val |= BIT(DWC_GAHBCFG_GINTMSK);
	sys_write32(reg_val, priv->base_addr + DWC_GAHBCFG_OFFSET);

	return ret_val;
}

/* reset port */
static int uhc_stm32_reset_port(struct dev_priv_data *priv)
{
	int ret_val = 0;
	uint8_t reset_cnt = 0;
	mem_addr_t base_addr = priv->base_addr;
	volatile uint32_t hprt = 0;
	uint32_t reg_val = 0;

	do {
		reset_cnt++;
		hprt = sys_read32(base_addr + DWC_HPRT_OFFSET);
		hprt &= ~(BIT(DWC_HPRT_PORT_EN) | BIT(DWC_HPRT_PORT_CONN_DET) |
			  BIT(DWC_HPRT_PORT_ENCHNG) | BIT(DWC_HPRT_PORT_OCCHNG));

		reg_val = (BIT(DWC_HPRT_PORT_RST) | hprt);
		sys_write32(reg_val, base_addr + DWC_HPRT_OFFSET);

		/* must wait atleast 10 ms before clearing reset bit */
		k_msleep(DWC_PORT_RESET_TIMEOUT_VAL);
		reg_val = ((~BIT(DWC_HPRT_PORT_RST)) & hprt);
		sys_write32(reg_val, base_addr + DWC_HPRT_OFFSET);
		k_msleep(DWC_PORT_RESET_TIMEOUT_VAL);
	} while (!(priv->port_enabled) && (reset_cnt <= DWC_MAX_RESET_TRIES));

	if (reset_cnt > DWC_MAX_RESET_TRIES) {
		ret_val = -ETIMEDOUT;
		LOG_ERR("resetting port timed out");
	}

	return ret_val;
}

/* enable core to be ready for enumeration process */
static int uhc_stm32_enable(const struct device *dev)
{
	int ret_val = -ENODEV;
	struct dev_priv_data *priv = uhc_get_private(dev);

	if (priv->device_connected) {
		ret_val = uhc_stm32_reset_port(priv);

		/* open control transfer pipes required for enumeration */
		if (!ret_val) {
			ret_val = uhc_stm32_open_pipe(priv, DWC_DEFAULT_CTRL_PIPE_OUT, 0x00,
						DWC_DEFAULT_ADDRESS, DWC_DEVICE_SPEED_FULL,
						DWC_EP_TYPE_CTRL, DWC_DEFAULT_MPS);
			if (!ret_val) {
				ret_val = uhc_stm32_open_pipe(priv, DWC_DEFAULT_CTRL_PIPE_IN, 0x80,
							DWC_DEFAULT_ADDRESS, DWC_DEVICE_SPEED_FULL,
							DWC_EP_TYPE_CTRL, DWC_DEFAULT_MPS);
				if (ret_val) {
					LOG_ERR("pipes opening failed");
				}
			}
		}
	}

