faloj/zephyr/drivers/usb/uhc/uhc_dwc_stm32.c
	return ret_val;
}

static int uhc_stm32_disable(const struct device *dev)
{
	return 0;
}

static int uhc_stm32_shutdown(const struct device *dev)
{
	struct dev_priv_data *priv = uhc_get_private(dev);
	uint32_t reg_val = 0;

	/* disable global interrupt */
	reg_val = sys_read32(priv->base_addr + DWC_GAHBCFG_OFFSET);
	reg_val &= ~BIT(DWC_GAHBCFG_GINTMSK);
	sys_write32(reg_val, priv->base_addr + DWC_GAHBCFG_OFFSET);

	irq_disable(DT_INST_IRQN(0));

	uhc_configure_vbus(dev, priv->base_addr, false);

	int err = priv_clock_disable(dev);

	if (err) {
		LOG_ERR("Failed to disable USB clock (%d)", err);
		return err;
	}

	return 0;
}

static int uhc_stm32_lock(const struct device *dev)
{
	return uhc_lock_internal(dev, K_FOREVER);
}

static int uhc_stm32_unlock(const struct device *dev)
{
	return uhc_unlock_internal(dev);
}

static int usbh_pre_init(void)
{
	int err = 0;

	err = usbh_init(&stm32_otg_ctx);
	if (err == -EALREADY) {
		LOG_ERR("host: USB host already initialized");
	} else if (err) {
		LOG_ERR("host: Failed to initialize %d", err);
	} else {
		LOG_DBG("host: USB host initialized");
	}

	return err;
}

/* preinitialize the driver data structures */
static int uhc_stm32_driver_preinit(const struct device *dev)
{
	DEVICE_MMIO_MAP(dev, K_MEM_CACHE_NONE);

	struct dev_priv_data *priv = uhc_get_private(dev);
	struct uhc_data *data = dev->data;
	const struct uhc_cfg * const cfg = dev->config;
	int ret;

	priv->dev = dev;
	k_mutex_init(&data->mutex);
	k_fifo_init(&priv->fifo);

	k_thread_create(&drv_stack_data, drv_stack, K_KERNEL_STACK_SIZEOF(drv_stack),
			(k_thread_entry_t)uhc_stm32_thread, (void *)dev, NULL, NULL, K_PRIO_COOP(2), 0,
			K_NO_WAIT);
	k_thread_name_set(&drv_stack_data, "uhc_stm32");

	/* reset USB */
	if (cfg->reset_spec.dev != NULL) {
		ret = uhc_stm32_reset_config(&(cfg->reset_spec));
		if (ret != 0) {
			return ret;
		}
	}

	USBH_DEFINE(dwc2, usbh_pre_init);
	LOG_DBG("UHC STM32 driver pre-initialized");

	return 0;
}

/* initialize UHC APIs */
static const struct uhc_api uhc_stm32_api = {
	.lock = uhc_stm32_lock,
	.unlock = uhc_stm32_unlock,
	.init = uhc_stm32_init,
	.enable = uhc_stm32_enable,
	.disable = uhc_stm32_disable,
	.shutdown = uhc_stm32_shutdown,
	.ep_enqueue = uhc_stm32_enqueue,
	.ep_dequeue = uhc_stm32_dequeue,
	.pipe_open = uhc_stm32_pipe_open,
};

static struct dev_priv_data uhc_stm32_priv = {
	.xfr_sem = Z_SEM_INITIALIZER(uhc_stm32_priv.xfr_sem, 0, 1),
	.xfr_event_sem = Z_SEM_INITIALIZER(uhc_stm32_priv.xfr_event_sem, 0, 1),
};

static struct uhc_data uhc_stm32_data = {
	.priv = &uhc_stm32_priv,
};

PINCTRL_DT_INST_DEFINE(0);

struct uhc_cfg uhc_stm32_cfg = {
	DEVICE_MMIO_ROM_INIT(DT_DRV_INST(0)),
	.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(0),
	.vbus_enable_gpio = GPIO_DT_SPEC_INST_GET_OR(0, vbus_gpios, {0}),
#if DT_INST_NUM_CLOCKS(0) > DT_CLOCKS_PROP_MAX_LEN
#error Illegal number of elements defined in the "clocks" property in device tree
#else
	.clocks = STM32_DT_INST_CLOCKS(0),
#endif
};

/* instantiate a device */
DEVICE_DT_INST_DEFINE(0, uhc_stm32_driver_preinit, NULL, &uhc_stm32_data, &uhc_stm32_cfg, POST_KERNEL,
		      CONFIG_KERNEL_INIT_PRIORITY_DEVICE, &uhc_stm32_api);
